{
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "displayName": "Compliance--1",
    "version": 4,
    "passwordRequired": true,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": true,
    "passwordRequiredType": "numeric",
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": "10.0.19045",
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": true,
    "secureBootEnabled": false,
    "codeIntegrityEnabled": false,
    "storageRequireEncryption": false,
    "id": "7427e1f0-fd47-4672-a51c-2b118973920d"
}
