{
    "Description": null,
    "DeviceSettingStateSummaries": null,
    "DisplayName": "Compliance--1",
    "Version": 4,
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "passwordRequired": false,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordRequiredType": "numeric",
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": "10.0.19045",
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": true,
    "secureBootEnabled": false,
    "codeIntegrityEnabled": false,
    "storageRequireEncryption": false
}
